{
    "categories": [
        {
            "id": "start",
            "name": {
                "de": "Einsteiger-Websites",
                "en": "Beginner Websites"
            },
            "description": {
                "de": "",
                "en": ""
            },
            "websites": [
                {
                    "id": "cafe",
                    "name": {
                        "de": "cafe",
                        "en": "cafe"
                    },
                    "description": {
                        "de": "Perfekte Website um rukzuk kennen zu lernen. Einfache Struktur, klares Layout.",
                        "en": "Perfect website to learn rukzuk. Simple structure, clean layout."
                    }
                }
            ]
        },
        {
            "id": "examples",
            "name": {
                "de": "Fortgeschrittene Websites",
                "en": "Advanced Websites"
            },
            "description": {
                "de": "",
                "en": ""
            },
            "websites": [
                {
                    "id": "chui",
                    "name": {
                        "de": "chui",
                        "en": "chui"
                    },
                    "description": {
                        "de": "ist mit bildschirmfüllenden Fotos und der minimalistischen Projektübersicht ideal für dein kreatives Portfolio.",
                        "en": "makes for a great creative portfolio with full-screen images and a slick project showcase."
                    }
                },
                {
                    "id": "moyo",
                    "name": {
                        "de": "moyo",
                        "en": "moyo"
                    },
                    "description": {
                        "de": "ist mit großen Bildern, eleganter Typografie und großzügigem Weißraum die ideale Vorlage für deine Reise- oder Veranstaltungs-Website.",
                        "en": "is a great fit for travel or event sites, featuring big images, elegant typography and plenty of whitespace."
                    }
                },
                {
                    "id": "lente",
                    "name": {
                        "de": "lente",
                        "en": "lente"
                    },
                    "description": {
                        "de": "Die flächendeckenden Hintergrundbildern und leuchtenden Farben definieren den Ausdruck. Großzügige Zwischenräume lenken nicht vom Wesentlichen ab.",
                        "en": "The strength of this layout lies in it’s fullscreen images and bright colors. Nothing distracts, so the roomy spacing puts the main attention to your contents and ideas."
                    }
                },
                {
                    "id": "het",
                    "name": {
                        "de": "het",
                        "en": "het"
                    },
                    "description": {
                        "de": "Das vielseitige Layout nutzt das Grid-Module für eine flexible Website. Die Modulkombinationen aus Text, Überschrift und Bild lassen sich leicht anpassen.",
                        "en": "The modern and versatile layout uses the grid module for a flexible website. The module combinations of text, headline and image make an individualization quick and easy."
                    }
                },
                {
                    "id": "blik",
                    "name": {
                        "de": "blik",
                        "en": "blik"
                    },
                    "description": {
                        "de": "ist ein minimalistischer One-Pager. Per Scrolling gelangt man zu den verschiedenen Inhaltsbereichen. Die Navigation wird automatisch aus den Sprungmarken generiert.",
                        "en": "is a single page website. Their content can be explored by scrolling down. The navigation is generated by anchor links at the top of each content area."
                    }
                },
                {
                    "id": "floke",
                    "name": {
                        "de": "floke",
                        "en": "floke"
                    },
                    "description": {
                        "de": "bringt deine großartigen Bilder bildschirmfüllend raus, während das responsive Kachel-Layout den perfekten Überblick verschafft.",
                        "en": "comes with screen-filling picture sliders and a responsive tile layout to provide a perfect overview of your content."
                    }
                },
                {
                    "id": "arc",
                    "name": {
                        "de": "arc",
                        "en": "arc"
                    },
                    "description": {
                        "de": "ist ein One-Pager für Puristen und Freunde von klaren Linien. Die Fullscreen-Landingpage bildet den perfekten Auftritt für deine Bilder und den ersten guten Eindruck.",
                        "en": "is a one-pager for purists and friends of clean lines. The first great impression is featured by your high resolution fullscreen images."
                    }
                },
                {
                    "id": "ras",
                    "name": {
                        "de": "ras",
                        "en": "ras"
                    },
                    "description": {
                        "de": "besitzt ein zweispaltiges Layout. Features sind Textbausteine, eine Galerie, ein Kontaktformular und die Einbindung von Google Maps.",
                        "en": "wins over its modern, two-column layout. Features are a gallery, a contact form, the integration of Google Maps and text areas."
                    }
                },
                {
                    "id": "swift",
                    "name": {
                        "de": "swift",
                        "en": "swift"
                    },
                    "description": {
                        "de": "Eine einfache, unkomplizierte Blog-Vorlage. Starke Fokussierung auf den Text. Einfache Personalisierung durch die Veränderung von Hintergründe und Typografie.",
                        "en": "A simple, straightforward blog template. Puts the focus on your writing across all screen sizes. Customize backgrounds and typography to make it yours."
                    }
                },
                {
                    "id": "squares",
                    "name": {
                        "de": "squares",
                        "en": "squares"
                    },
                    "description": {
                        "de": "Ermöglicht neben einer Übersicht für komplexe Inhalte ein funktionales Detail-Layout, dass sich auch für lange Text-Inhalte anbietet.",
                        "en": "Next to an teaser overview for complex themes it offers a functional layout for details, that adjusts perfectly to text-heavy content."
                    }
                },
                {
                    "id": "spot",
                    "name": {
                        "de": "spot",
                        "en": "spot"
                    },
                    "description": {
                        "de": "unterstreicht die Bedeutung deiner Kernaussage. Per Scrolling lassen sich endlos mit Galerie, Slider und Textspalten die Details deines Vorhaben beschreiben.",
                        "en": "puts the focus on your key message. Its meaning can be underlined and described endlessly using slider, gallery and article snippets."
                    }
                },
                {
                    "id": "zwyk",
                    "name": {
                        "de": "zwyk",
                        "en": "zwyk"
                    },
                    "description": {
                        "de": "bietet vor allem für Websites mit komplexen Inhalten eine funktionale Struktur und einen sachlichen Aufbau, die schnell deinen Vorstellungen angepasst werden kann.",
                        "en": "delivers a functional structure and a substantial construction, especially helpful for websites with more complex and textbased contents."
                    }
                }
            ]
        },
        {
            "id": "wireframes",
            "name": {
                "de": "Wireframes",
                "en": "Wireframes"
            },
            "description": {
                "de": "",
                "en": ""
            },
            "websites": [
                {
                    "id": "wireframe-one-page",
                    "name": {
                        "de": "One-Page-Wireframe",
                        "en": "One Page Wireframe"
                    },
                    "description": {
                        "de": "der funktionale Prototyp mit vorkonfigurierten Modulen, deren Konstruktion im Fokus steht, gibt dir einen grundsätzlichen Einblick in den Aufbau einer rukzuk Website.",
                        "en": "this functional prototype with preconfigured modules, offers you a basic overview on the construction of rukzuk websites."
                    }
                },
                {
                    "id": "wireframe",
                    "name": {
                        "de": "Wireframe",
                        "en": "Wireframe"
                    },
                    "description": {
                        "de": "der funktionale Prototyp mit vorkonfigurierten Modulen, deren Konstruktion im Fokus steht, gibt dir einen grundsätzlichen Einblick in den Aufbau einer rukzuk Website.",
                        "en": "this functional prototype with preconfigured modules, offers you a basic overview on the construction of rukzuk websites."
                    }
                },
                {
                    "id": "wireframe-blog",
                    "name": {
                        "de": "Blog-Wireframe",
                        "en": "Blog Wireframe"
                    },
                    "description": {
                        "de": "Nutze diesen Prototypen um schnell einen individuellen Blog zu gestalten.",
                        "en": "Use this functional prototype with preconfigured modules as a baseline for your own designs."
                    }
                },
                {
                    "id": "wireframe-shop",
                    "name": {
                        "de": "Shop-Wireframe",
                        "en": "Shop Wireframe"
                    },
                    "description": {
                        "de": "Das funktionale Shop-Wireframe gibt dir einen grundsätzlichen Einblick in den Aufbau eines Online-Shops mit rukzuk.",
                        "en": "The shop wireframe provides a clean, minimalist design for a shop with some products. Its fully responsive and highly customizable."
                    }
                }
            ]
        }
    ]
}
