{
    "name": {
        "de": "Passwortschutz",
        "en": "Password protection"
    },
    "description": {
        "de": "",
        "en": ""
    },
    "version": "dev",
    "formValues": {
        "enableProtectedPage": false
    },
    "form": [
        {
            "type": "Comment",
            "text": "{\"de\": \"Wenn der Passwortschutz aktiviert ist, muss man sich mit Login und Passwort authentifizieren, um die angegebene Seite (und alle darunter liegenden Seiten) anschauen zu dürfen. Wird keine Seite ausgewählt, dann ist die gesamte Website geschützt. Der Passwortschutz funktioniert standardmässig nur auf dem Liveserver. Hinweis: Downloads sind nicht automatisch mit geschützt. Gibt einer deiner Besucher einen Direktlink zu einer Datei weiter, können auch Unberechtigte Zugang zur Datei erhalten. Diese Funktion ist nicht für sehr vertrauliche Informationen geeignet.\", \"en\": \"Password protected means that you must authenticate with a login and password to access the specified page (and all pages underneath). The password protection is by default enabled on the live server only. Note: Downloads are not automatically protected. If an authorized person passes on a direct link to a file, unauthorized access to the file can be obtained. This function is not suitable for very sensitive information.\"}"
        },
        {
            "type": "OnOffFieldSet",
            "CMSvar": "enableProtectedPage",
            "fieldLabel": "{\"de\": \"Passwortschutz aktivieren\", \"en\": \"Enable password protection\"}",
            "_items": [
                {
                    "type": "InternalLinkChooser",
                    "CMSvar": "protectedPage",
                    "fieldLabel": "{\"de\": \"Geschützte Seite (alle darunterliegenden Seiten sind ebenfalls geschützt)\", \"en\": \"Password protected page (all subpages are also protected\"}"
                },
                {
                    "type": "TextArea",
                    "CMSvar": "loginPasswords",
                    "fieldLabel": "{\"de\": \"Logins und Passwörter\", \"en\": \"Logins and passwords\"}",
                    "emptyText": "mylogin:mypassword",
                    "height": 120
                },
                {
                    "type": "Comment",
                    "text": "{\"de\": \"Die Logins und Passwörter werden im Format Login:Passwort eingegeben. Es können beliebig viele Login/Passwort-Kombinationen hinterlegt werden. Beispiel: <br><br>meinlogin1:meinPasswort2<br>meinLogin2:meinPasswort2<br><br>\", \"en\": \"Logins and passwords have to be entered in the format login:password. You can define an unlimited number of login/password combinations. Example: <br><br>mylogin1:mypassword1<br>mylogin2:mypassword2<br><br>\"}"
                },
                {
                    "type": "OnOffToggle",
                    "CMSvar": "inPreviewMode",
                    "fieldLabel": "{\"de\": \"Passwortschutz auch in der Vorschau aktivieren (zu Testzwecken)\", \"en\": \"Activate page protection in preview mode (for testing purposes)\"}"
                }
            ]
        }
    ]
}
